tut/passiveScalarsimpleFoam/tut/streetCanyon2D3/0/TS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    buildingWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
