tut/passiveScalarsimpleFoam/tut/streetCanyon2D3/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
14431
(
0.00199503
0.00598503
0.00999603
0.014028
0.018081
0.022176
0.026313
0.030492
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
59
(
0.002496
0.00617011
0.0101079
0.014108
0.0181431
0.0222267
0.0263557
0.0305289
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
59
(
0.002496
0.00617011
0.0101079
0.014108
0.0181431
0.0222267
0.0263557
0.0305289
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 1e-15;
    }
    buildingWall
    {
        type            calculated;
        value           uniform 1e-15;
    }
}


// ************************************************************************* //
