tut/passiveScalarsimpleFoam/tut/streetCanyon2D3/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
104
(
39.9006
39.9006
39.9006
39.9006
39.9006
39.9006
39.9006
39.9006
...
)
;
    }
    buildingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
305
(
28.5714
28.5714
28.5714
28.5714
28.5714
28.5714
28.5714
28.5714
...
)
;
    }
}


// ************************************************************************* //
