tut/passiveScalarsimpleFoam/tut/streetCanyon2D3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers //袋鼠求解器
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }

    "(U|k|epsilon|R|nuTilda|TS)" //浓度和速度的方程相似
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        //relTol          0.1; //relTol(相对残差)tol（绝对残差）
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;//not recommended for steady-state solvers

    residualControl//外残差（initial residual）只对稳态的求解器有：时态方程间的残差。convergence 1e-6
    {
        p               1e-6;
        U               1e-6;
        TS              1e-6;
        "(k|epsilon|omega)" 1e-6;
    }
    
    pRefCell 0;
    pRefValue 1e5; 
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
        R               0.7;
        nuTilda         0.7;
        TS              0.3;
    }
}


// ************************************************************************* //
